In [1]:
import numpy as np
import pandas as pd

In [5]:
df = pd.DataFrame({'kol1':[1,2,3,4],
                  'kol2':[444,555,666,444],
                  'kol3':['abc','def','ghi','xyz']})

In [7]:
df.head()

   kol1  kol2 kol3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [8]:
# unikalne wartości
df['kol2'].unique()

array([444, 555, 666], dtype=int64)

In [11]:
# ilość unikalnych wartości metoda nunique
df['kol2'].nunique() # można także użyć syntaxu python: len(df['kol2'].unique())

3

In [14]:
# ile razy występuje wrtość w danej kolumnie
df['kol2'].value_counts()

444    2
555    1
666    1
Name: kol2, dtype: int64

In [16]:
# warunkowe wybieranie cd

In [17]:
df

   kol1  kol2 kol3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [18]:
df[df['kol1']>2]

   kol1  kol2 kol3
2     3   666  ghi
3     4   444  xyz

In [21]:
df[(df['kol1']>2) & (df['kol2']==444)]

   kol1  kol2 kol3
3     4   444  xyz

In [24]:
# stosowanie własnych funkcji z pandasem

In [25]:
def mnoz2(x):
    return x*2

In [26]:
df['kol1'].apply(mnoz2)

0    2
1    4
2    6
3    8
Name: kol1, dtype: int64

In [27]:
# kolejny przyklad z wbudowanymi funkcjami:

In [28]:
df['kol3'].apply(len)

0    3
1    3
2    3
3    3
Name: kol3, dtype: int64

In [29]:
# zastosowanie lambdy

In [31]:
df['kol2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: kol2, dtype: int64

In [32]:
# uzyskanie nazw kolumn

In [33]:
df.columns

Index(['kol1', 'kol2', 'kol3'], dtype='object')

In [34]:
# uzyskanie nazw indeksów

In [36]:
df.index # zwróci w formie zasięgu indeksu - podobnie jak funkcja range()

RangeIndex(start=0, stop=4, step=1)

In [37]:
# sortowanie

In [38]:
df.sort_values('kol2')

   kol1  kol2 kol3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [39]:
# sprawdzenie czy w DataFrame jest null

In [40]:
df.isnull()

    kol1   kol2   kol3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [44]:
# tabela przestawna

In [45]:
dane = {'A':['foo','foo','foo','bar','bar','bar'],
       'B':['jeden','jeden','dwa','dwa','jeden','jeden'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(dane)

In [46]:
df

     A      B  C  D
0  foo  jeden  x  1
1  foo  jeden  y  3
2  foo    dwa  x  2
3  bar    dwa  y  5
4  bar  jeden  x  4
5  bar  jeden  y  1

In [49]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C            x    y
A   B
bar dwa    NaN  5.0
    jeden  4.0  1.0
foo dwa    2.0  NaN
    jeden  1.0  3.0